In [1]:
import pandas as pd
import numpy as np

In [13]:
data = {'color' : ['blue','green','yellow','red','white'],
       'object' : ['ball','pen','pencil','paper','mug'],
       'price' : [1.2,1.0,0.6,0.9,1.7]}

In [14]:
frame = pd.DataFrame(data)
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [9]:
frame2 = pd.DataFrame(data, index = ['one','two','three','four','five'])
frame2

        color  object  price
one      blue    ball    1.2
two     green     pen    1.0
three  yellow  pencil    0.6
four      red   paper    0.9
five    white     mug    1.7

In [11]:
frame3 = pd.DataFrame(np.arange(16).reshape(4,4),
                      index = ['red','blue','yellow','whhite'],
                      columns=['ball','pen','pencil','paper'])
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
whhite    12   13      14     15

In [12]:
frame.columns

Index(['color', 'object', 'price'], dtype='object')

In [13]:
frame.index

RangeIndex(start=0, stop=5, step=1)

In [14]:
frame.values

array([['blue', 'ball', 1.2],
       ['green', 'pen', 1.0],
       ['yellow', 'pencil', 0.6],
       ['red', 'paper', 0.9],
       ['white', 'mug', 1.7]], dtype=object)

In [18]:
frame['price']

0    1.2
1    1.0
2    0.6
3    0.9
4    1.7
Name: price, dtype: float64

In [32]:
frame.loc[2]

color     yellow
object    pencil
price        0.6
Name: 2, dtype: object

In [24]:
frame.loc[[2,2,4]]

    color  object  price
2  yellow  pencil    0.6
2  yellow  pencil    0.6
4   white     mug    1.7

In [27]:
frame[0:3]

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6

In [29]:
frame['object'][3]

'paper'

In [39]:
frame.index.name = 'id'
frame.columns.name = 'item'
frame

item   color  object  price
id
0       blue    ball    1.2
1      green     pen    1.0
2     yellow  pencil    0.6
3        red   paper    0.9
4      white     mug    1.7

In [41]:
frame['newcol'] = 12
frame

item   color  object  price  newcol
id
0       blue    ball    1.2      12
1      green     pen    1.0      12
2     yellow  pencil    0.6      12
3        red   paper    0.9      12
4      white     mug    1.7      12

In [58]:
frame['newcol'] = [1,0.5,0.5,1,1.6]
frame

item   color   object  price  newcol
id
0       blue     ball    1.2     1.0
1      green      pen    1.0     0.5
2     yellow  ballpen    0.6     0.5
3        red    paper    0.9     1.0
4      white      mug    1.7     1.6

In [59]:
ser = pd.Series(np.arange(5))
ser

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [60]:
frame['newcol'] = ser
frame

item   color   object  price  newcol
id
0       blue     ball    1.2       0
1      green      pen    1.0       1
2     yellow  ballpen    0.6       2
3        red    paper    0.9       3
4      white      mug    1.7       4

In [61]:
frame['object'][2] = 'ballpen'
frame

<ipython-input-61-e561c7ab855c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame['object'][2] = 'ballpen'

item   color   object  price  newcol
id
0       blue     ball    1.2       0
1      green      pen    1.0       1
2     yellow  ballpen    0.6       2
3        red    paper    0.9       3
4      white      mug    1.7       4

In [62]:
frame.isin([1.0,'mug'])

item  color  object  price  newcol
id
0     False   False  False   False
1     False   False   True    True
2     False   False  False   False
3     False   False  False   False
4     False    True  False   False

In [80]:
frame[frame.isin([1.0,'mug'])]

item color object  price
id
0      NaN    NaN    NaN
1      NaN    NaN    1.0
2      NaN    NaN    NaN
3      NaN    NaN    NaN
4      NaN    mug    NaN

In [64]:
del frame['newcol']
frame

item   color   object  price
id
0       blue     ball    1.2
1      green      pen    1.0
2     yellow  ballpen    0.6
3        red    paper    0.9
4      white      mug    1.7

In [74]:
frame[frame['price'] > 1]['price']

id
0    1.2
4    1.7
Name: price, dtype: float64

In [75]:
nestdict = { 'red': { 2012: 22, 2013: 33 },
 'white': { 2011: 13, 2012: 22, 2013: 16},
 'blue': {2011: 17, 2012: 27, 2013: 18}}

In [77]:
frame2 = pd.DataFrame(nestdict)
frame2

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

In [78]:
frame2.T

       2012  2013  2011
red    22.0  33.0   NaN
white  22.0  16.0  13.0
blue   27.0  18.0  17.0

In [3]:
ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
ser.index

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

In [5]:
ser.idxmin()

'blue'

In [7]:
ser.idxmax()

'white'

In [9]:
serd = pd.Series(range(6), index=['white','white','blue','green',
'green','yellow'])
serd

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

In [10]:
serd['white']

white    0
white    1
dtype: int64

In [12]:
serd.index.is_unique

False

In [15]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [16]:
frame.index.is_unique

True

In [19]:
serd = pd.Series([2,5,7,4], index = ['one','two','three','four'])
serd

one      2
two      5
three    7
four     4
dtype: int64

In [22]:
serd.reindex(['three','four','five','one','two'])

three    7.0
four     4.0
five     NaN
one      2.0
two      5.0
dtype: float64

In [23]:
ser3 = pd.Series([1,5,6,3], index = [0,3,5,6])
ser3

0    1
3    5
5    6
6    3
dtype: int64

In [25]:
ser3.reindex(range(6),method = 'bfill')

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

In [26]:
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [31]:
frame.reindex(range(5), method='ffill',columns=['colors','price','new',
'object'])

   colors  price     new  object
0    blue    1.2    blue    ball
1   green    1.0   green     pen
2  yellow    0.6  yellow  pencil
3     red    0.9     red   paper
4   white    1.7   white     mug

In [34]:
ser = pd.Series(np.arange(4), index = ['red','blue','yellow','white'])
ser

red       0
blue      1
yellow    2
white     3
dtype: int32

In [37]:
ser.drop('yellow')

red      0
blue     1
white    3
dtype: int32

In [38]:
ser.drop(['white','blue'])

red       0
yellow    2
dtype: int32

In [40]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), 
                    index = ['red', 'blue', 'yellow', 'white'],
                    columns = ['ball', 'pen', 'pencil', 'paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [41]:
frame.drop(['red','blue'])

        ball  pen  pencil  paper
yellow     8    9      10     11
white     12   13      14     15

In [42]:
frame.drop(['pen','pencil'], axis=1)

        ball  paper
red        0      3
blue       4      7
yellow     8     11
white     12     15

In [3]:
s1 = pd.Series([3,2,5,1],['white','yellow','green','blue'])
s2 = pd.Series([1,4,7,2,1],['white','yellow','black','blue','brown'])

In [4]:
s1 + s2

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [6]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],columns=['ball','pen','pencil','paper'])
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)),index=['blue','green','white','yellow'],columns=['mug','pen','ball'])

In [7]:
frame1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [8]:
frame2

        mug  pen  ball
blue      0    1     2
green     3    4     5
white     6    7     8
yellow    9   10    11

In [9]:
 frame1 + frame2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [10]:
 frame1.add(frame2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [11]:
 frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],columns=['ball','pen','pencil','paper'])

In [12]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [13]:
ser = pd.Series(np.arange(4), index=['ball','pen','pencil','paper'])

In [14]:
ser

ball      0
pen       1
pencil    2
paper     3
dtype: int32

In [16]:
frame + ser

        ball  pen  pencil  paper
red        0    2       4      6
blue       4    6       8     10
yellow     8   10      12     14
white     12   14      16     18

In [17]:
frame - ser

        ball  pen  pencil  paper
red        0    0       0      0
blue       4    4       4      4
yellow     8    8       8      8
white     12   12      12     12

In [1]:
ser['mug'] = 9

NameError: name 'ser' is not defined

In [2]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [3]:
np.sqrt(frame)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [4]:
f = lambda x : x.max() - x.min()

In [5]:
frame.apply(f)

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [6]:
frame.apply(f,axis=1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [7]:
def z(x):
    return pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [8]:
frame.apply(z)

     ball  pen  pencil  paper
min     0    1       2      3
max    12   13      14     15

In [9]:
frame.apply(z,axis=1)

        min  max
red       0    3
blue      4    7
yellow    8   11
white    12   15

In [10]:
frame.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [11]:
frame.mean()

ball      6.0
pen       7.0
pencil    8.0
paper     9.0
dtype: float64

In [12]:
frame.describe()

            ball        pen     pencil      paper
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [14]:
ser = pd.Series([5,0,3,8,4], index = ['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [16]:
ser.sort_index()

blue      0
green     4
red       5
white     8
yellow    3
dtype: int64

In [17]:
ser.sort_index(ascending=False)

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [11]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [19]:
frame.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [20]:
frame.sort_index(axis=1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [21]:
ser.sort_values()

blue      0
yellow    3
green     4
red       5
white     8
dtype: int64

In [22]:
frame.sort_values(by='pen')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [23]:
frame.sort_values(by=['ball','pen'])

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [24]:
ser.rank()

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [25]:
ser.rank(method='first') # (without a sorting operation).

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [31]:
ser.rank(ascending=False) #default, ranking follows ascending sort.

red       2.0
blue      5.0
yellow    4.0
white     1.0
green     3.0
dtype: float64

In [32]:
seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008',
'2009','2010','2011','2012','2013'])
seq2

2006    3
2007    4
2008    3
2009    4
2010    5
2011    4
2012    3
2013    2
dtype: int64

In [34]:
seq = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008',
'2009','2010','2011','2012','2013'])
seq

2006    1
2007    2
2008    3
2009    4
2010    4
2011    3
2012    2
2013    1
dtype: int64

In [35]:
seq.corr(seq2)

0.7745966692414835

In [36]:
seq.cov(seq2)

0.8571428571428571

In [37]:
frame2 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame2

        ball  pen  pencil  paper
red        1    4       3      6
blue       4    5       6      1
yellow     3    3       1      5
white      4    1       6      4

In [38]:
frame2.corr()

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000

In [39]:
frame2.cov()

            ball       pen    pencil     paper
ball    2.000000 -0.666667  2.000000 -2.333333
pen    -0.666667  2.916667 -0.333333 -1.333333
pencil  2.000000 -0.333333  6.000000 -3.666667
paper  -2.333333 -1.333333 -3.666667  4.666667

In [41]:
ser = pd.Series([0,1,2,3,9],
... index=['red','blue','yellow','white','green'])
ser

red       0
blue      1
yellow    2
white     3
green     9
dtype: int64

In [42]:
frame2.corrwith(ser)

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

In [43]:
frame2.corrwith(frame)

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

In [45]:
ser = pd.Series([0,1,2,np.NaN,9],
... index=['red','blue','yellow','white','green'])
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [46]:
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [47]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [50]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
... index = ['blue','green','red'],
... columns = ['ball','mug','pen'])
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [52]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [53]:
frame3.dropna(how='all')

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

In [54]:
frame3.fillna(3)

       ball  mug  pen
blue    6.0  3.0  6.0
green   3.0  3.0  3.0
red     2.0  3.0  5.0

In [55]:
frame3.fillna({'ball':1,'mug':2})

       ball  mug  pen
blue    6.0  2.0  6.0
green   1.0  2.0  NaN
red     2.0  2.0  5.0

In [4]:
mser = pd.Series(np.random.rand(8),
... index=[['white','white','white','blue','blue','red','red',
 'red'],
... ['up','down','right','up','down','up','down','left']])

mser

white  up       0.529782
       down     0.491166
       right    0.019309
blue   up       0.940950
       down     0.126158
red    up       0.482530
       down     0.907557
       left     0.033509
dtype: float64

In [5]:
mser.index

MultiIndex([('white',    'up'),
            ('white',  'down'),
            ('white', 'right'),
            ( 'blue',    'up'),
            ( 'blue',  'down'),
            (  'red',    'up'),
            (  'red',  'down'),
            (  'red',  'left')],
           )

In [6]:
mser['white']

up       0.529782
down     0.491166
right    0.019309
dtype: float64

In [7]:
mser[:,'up']

white    0.529782
blue     0.940950
red      0.482530
dtype: float64

In [8]:
mser['white','up']

0.5297824808425793

In [9]:
mser.unstack()

           down      left     right        up
blue   0.126158       NaN       NaN  0.940950
red    0.907557  0.033509       NaN  0.482530
white  0.491166       NaN  0.019309  0.529782

In [12]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [13]:
frame.stack()

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        9
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int32

In [6]:
mframe = pd.DataFrame(np.random.rand(16).reshape(4,4),
         index = [['white','white','red','red'],
                ['up', 'down', 'up', 'down']],
         columns=[['pen','pen','paper','paper'],[1,2,1,2]])
mframe

                 pen               paper
                   1         2         1         2
white up    0.654708  0.590235  0.278149  0.232888
      down  0.028205  0.253942  0.719487  0.419592
red   up    0.536231  0.509843  0.882574  0.965247
      down  0.684431  0.189680  0.336753  0.837546

In [7]:
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']
mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up      0.654708  0.590235  0.278149  0.232888
       down    0.028205  0.253942  0.719487  0.419592
red    up      0.536231  0.509843  0.882574  0.965247
       down    0.684431  0.189680  0.336753  0.837546

In [8]:
 mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white   0.654708  0.590235  0.278149  0.232888
down   white   0.028205  0.253942  0.719487  0.419592
up     red     0.536231  0.509843  0.882574  0.965247
down   red     0.684431  0.189680  0.336753  0.837546

In [11]:
mframe.sort_index(level='colors')

objects             pen               paper
id                    1         2         1         2
colors status
red    down    0.684431  0.189680  0.336753  0.837546
       up      0.536231  0.509843  0.882574  0.965247
white  down    0.028205  0.253942  0.719487  0.419592
       up      0.654708  0.590235  0.278149  0.232888